In [75]:
import pandas as pd
import numpy as np

In [79]:
a=np.array([[1,2,3],[4,5,6],[7,8,9]])

In [81]:
data=pd.DataFrame(a)

In [82]:
data

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [83]:
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [98]:
data_1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'],index=[1,2,3])

In [99]:
data_1

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [140]:
data_2=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'],index=pd.MultiIndex.from_tuples(
[('D',1),('E',2),('F',3)],
    names=['N','V']
))

In [141]:
data_2

     A  B  C
N V
D 1  1  2  3
E 2  4  5  6
F 3  7  8  9

In [142]:
data

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [151]:
data.index=pd.MultiIndex.from_tuples([('A',1),('B',2),('C',3)],names=['V','N'])

In [154]:
new_data=pd.DataFrame({
    'day':['Monday','Tuesday','wednesday','Thursday','Friday','Saturday','Sunday'],
    'Mumbai':[23,34,45,66,78,43,23],
    'Pune':[23,12,87,33,66,89,90],
    'Banglore':[33,66,77,90,91,92,76]
})

In [160]:
new_data_1=pd.melt(new_data)
new_data_1.rename(columns={
    'variable':'VAR',
    'value':'VAl'
})

         VAR        VAl
0        day     Monday
1        day    Tuesday
2        day  wednesday
3        day   Thursday
4        day     Friday
5        day   Saturday
6        day     Sunday
7     Mumbai         23
8     Mumbai         34
9     Mumbai         45
10    Mumbai         66
11    Mumbai         78
12    Mumbai         43
13    Mumbai         23
14      Pune         23
15      Pune         12
16      Pune         87
17      Pune         33
18      Pune         66
19      Pune         89
20      Pune         90
21  Banglore         33
22  Banglore         66
23  Banglore         77
24  Banglore         90
25  Banglore         91
26  Banglore         92
27  Banglore         76